        >>SOURCE FORMAT FREE
IDENTIFICATION DIVISION.
PROGRAM-ID. EXAM-1.
AUTHOR. John Stephen Johnson.
ENVIRONMENT DIVISION.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 SCOUNTRY.
      03 SCOUNTRYCODE PIC A(3).
      03 SJPY PIC A(3) VALUE 'JPY'.
      03 SAUF PIC A(3) VALUE 'AUF'.
      03 SCHF PIC A(3) VALUE 'CHF'.
      03 SCAD PIC A(3) VALUE 'CAD'.
      03 SEU PIC A(3) VALUE 'EU'.
01 SEXCHANGERATE.
      03 SINAMT PIC 9999V99.
      03 SJPYEX PIC 999V999 VALUE 115.743.
      03 SAUFEX PIC 9V99999 VALUE 0.72282.
      03 SCHFEX PIC 9V99999 VALUE 0.92594.
      03 SCADEX PIC 9V99999 VALUE 1.27165.
      03 SEUEX PIC 9V99999 VALUE 0.56760.
      03 SUSDAMOUNT PIC 9999V99.
01  SEXIT PIC XX.  
SCREEN SECTION.
01  FIRSTHEADERVARS.
      03  FHEADER.
       05  LINE 01 COL 01 VALUE ' LOAD EXCHANGE RATES '.
       05  LINE 02 COL 01 VALUE SPACES.
01  SECONDHEADERVARS.
      03  SHEADER.
       05  LINE 01 COL 01 VALUE ' CONVERT CURRENCY     '.
       05  LINE 02 COL 01 VALUE SPACES.
01  INPUTVARS.
      03  COUNTRYCODEVARS.
       05  LINE 6 COL 01 VALUE 'COUNTRY CODE'.
       05  COL 16  PIC A(3) TO SCOUNTRYCODE.
01 CONVERTVARS.
      03 CONVERSIONVARS.
       05  LINE 7 COL 01 VALUE 'CURRENCY TO CONVERT TO US DOLLARS'.
       05  COL 40 PIC A(7) TO SINAMT.
01 ERRORMSG.
      03 ERR.
       05 LINE 10 COL 01 VALUE 'CODE NOT IN TABLE'.
01 CLEARERR.
      03 CLRERR.
       05 LINE 10 COL 01 VALUE '                  '.

01  EXITMSG.
      03  LINE 24 COL 70  PIC XX TO SEXIT.
      03  COL 1  VALUE 'MORE DATA? (ANY KEY FOR YES OR TYPE NO):'.
01 USDAMT.
      03   LINE 10 COL 01 VALUE 'U.S. DOLLAR AMOUNT: $'.
      03   COL 25 PIC ZZZ9.99 FROM SUSDAMOUNT.
PROCEDURE DIVISION.
100-MAIN.
      PERFORM UNTIL SEXIT EQUALS 'NO' or 'no'
       DISPLAY FHEADER
       DISPLAY INPUTVARS
       ACCEPT INPUTVARS
       DISPLAY CONVERTVARS
       ACCEPT CONVERTVARS
       DISPLAY SHEADER
       IF SCOUNTRYCODE EQUALS SJPY OR SAUF OR SCHF OR SCAD OR SEU OR 'jpy' OR 'auf' OR 'chf' OR 'cad' OR 'eu'
           DISPLAY CLEARERR
           PERFORM 200-CURRENCYCALC
           DISPLAY USDAMT
           DISPLAY EXITMSG
           ACCEPT EXITMSG     
       ELSE
           DISPLAY ERRORMSG
           DISPLAY EXITMSG
           ACCEPT EXITMSG   
       END-IF 
      END-PERFORM.
      STOP RUN.

200-CURRENCYCALC.
      IF SCOUNTRYCODE EQUALS SJPY OR 'jpy'
       MOVE ZERO TO SUSDAMOUNT
       COMPUTE SUSDAMOUNT ROUNDED = SINAMT / SJPYEX
      END-IF.

      IF SCOUNTRYCODE EQUALS SAUF OR 'auf'
       MOVE ZERO TO SUSDAMOUNT
       COMPUTE SUSDAMOUNT ROUNDED = SINAMT / SAUFEX
      END-IF.

      IF SCOUNTRYCODE EQUALS SCHF OR 'chf'
       MOVE ZERO TO SUSDAMOUNT
       COMPUTE SUSDAMOUNT ROUNDED = SINAMT / SCHFEX
      END-IF.

      IF SCOUNTRYCODE EQUALS SCAD OR 'cad'
       MOVE ZERO TO SUSDAMOUNT
       COMPUTE SUSDAMOUNT ROUNDED = SINAMT / SCADEX
      END-IF.

      IF SCOUNTRYCODE EQUALS SEU OR 'eu'
       MOVE ZERO TO SUSDAMOUNT
       COMPUTE SUSDAMOUNT ROUNDED = SINAMT / SEUEX
      END-IF.
